Revit 2027 API
ITransactionFinalizer.OnCommitted Method
 This method is called at the end of committing a transaction
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void OnCommitted(
	Document document,
	string strTransactionName
)
Sub OnCommitted (
	document As Document,
	strTransactionName As String
)
void OnCommitted(
	Document^ document,
	String^ strTransactionName
)
abstract OnCommitted :
        document : Document *
        strTransactionName : string -> unit
Parameters
document Document
 The document associated with the transaction
strTransactionName String
 The transaction's name
See Also
Reference
ITransactionFinalizer Interface
Autodesk.Revit.DB Namespace